PWE3 Working Group                                 Thomas D. Nadeau, Ed.
Internet Draft                                                        BT
Expires: January 2009                                Monique Morrow, Ed.
                                                       Luca Martini, Ed.
Dinesh Mohan, Ed.                                  Carlos Pignataro, Ed.
Nortel                                                             Cisco

                                                               July 2008



                  Pseudo Wire (PW) OAM Message Mapping


                   draft-ietf-pwe3-oam-msg-map-07.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.


   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups. Note that other
   groups may also distribute working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time. It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/1id-abstracts.html

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

Abstract

   This document specifies the mapping of defect states between a Pseudo
   Wire and the Attachment Circuits (AC) of the end-to-end emulated
   service. This document covers the case whereby the ACs and the PWs
   are of the same type in accordance to the PWE3 architecture such that
   a homogenous PW service can be constructed.





Nadeau, et al.              Standards Track                     [Page 1]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008




Table of Contents

    1        Specification of Requirements  ........................   4
    2        Acknowledgments  ......................................   4
    3        Contributing Authors  .................................   4
    4        Introduction  .........................................   4
    5        Terminology  ..........................................   5
    6        Reference Model and Defect Locations  .................   6
    7        Abstract Defect States  ...............................   8
    8        PW Status and Defects  ................................   9
    8.1      PW Defects  ...........................................   9
    8.1.1    Packet Loss  ..........................................  10
    8.2      Defect Detection and Notification  ....................  10
    8.2.1    Defect Detection Tools  ...............................  10
    8.2.2    Defect  ...............................................  11
    8.3      Overview of fault notifications  ......................  12
    8.3.1    Use of Native Service notifications  ..................  13
    8.3.2    Use of Ethernet Native Service notifications  .........  14
    8.3.3    The Use of PW Status for MPLS and MPLS-IP PSNs  .......  15
    8.3.4    The Use of the L2TP Circuit Status AVP  ...............  16
    8.3.5    The Use of BFD Diagnostic Codes  ......................  18
    9        PW Defect State Entry/Exit  ...........................  19
    9.1      PW Forward Defect Entry/Exit  .........................  19
    9.2      PW reverse defect state entry/exit  ...................  20
    9.2.1    PW reverse defects with PE state synchronization  .....  20
   10        AC Defect States  .....................................  20
   10.1      Ethernet AC  ..........................................  20
   10.1.1    AC  ...................................................  20
   10.1.2    AC Reverse Defect State Entry or Exit  ................  21
   10.2      FR ACs  ...............................................  22
   10.3      ATM ACs  ..............................................  22
   10.3.1    AC Forward Defect State Entry/Exit  ...................  22
   10.3.2    AC Reverse Defect State Entry/Exit  ...................  23
   11        PW Forward Defect Entry/Exit procedures  ..............  23
   11.1      Procedures in FR Port Mode  ...........................  23
   11.2      Procedures in ATM Port Mode  ..........................  23
   11.3      PW Forward Defect Entry Procedures  ...................  24
   11.3.1    Ethernet AC Procedures  ...............................  24
   11.3.2    FR AC procedures  .....................................  25
   11.3.3    ATM AC procedures  ....................................  25
   11.3.4    Additional procedures for a FR PW, and an ATM PW  .....  25
   11.4      PW Forward Defect Exit Procedures  ....................  26
   11.4.1    Ethernet AC Procedures  ...............................  26
   11.4.2    FR AC procedures  .....................................  27
   11.4.3    ATM AC procedures  ....................................  27
   11.4.4    Additional procedures for a FR PW, and a  ATM PW  .....  27



Nadeau, et al.              Standards Track                     [Page 2]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   11.5      PW Reverse Defect Entry Procedures  ...................  28
   11.5.1    Ethernet AC Procedures  ...............................  28
   11.5.2    FR AC procedures  .....................................  28
   11.5.3    ATM AC procedures  ....................................  28
   11.6      PW Reverse Defect Exit Procedures  ....................  29
   11.6.1    Ethernet AC Procedures  ...............................  29
   11.6.2    FR AC procedures  .....................................  29
   11.6.3    ATM AC procedures  ....................................  29
   12        AC Defect Entry/Exit Procedures  ......................  29
   12.1      AC Forward Defect Entry  ..............................  29
   12.1.1    Procedures for an Ethernet PW  ........................  30
   12.1.2    Procedures for a FR/ATM PW in the out-of-band method  .  30
   12.1.3    Procedures for a ATM PW in the inband PW Method  ......  31
   12.1.4    Additional procedures for ATM ACs  ....................  31
   12.2      AC Reverse defect entry  ..............................  31
   12.2.1    Ethernet AC Procedures  ...............................  31
   12.2.2    Procedures for a FR/ATM PW in the out-of-band method  .  31
   12.2.3    Procedures for a ATM PW in the inband PW Method  ......  32
   12.3      AC Forward Defect Exit  ...............................  32
   12.3.1    Ethernet AC Procedures  ...............................  32
   12.3.2    Procedures for a FR/ATM PW in the out-of-band method  .  32
   12.3.3    Procedures for a ATM PW in the inband PW Method  ......  33
   12.3.4    Additional procedures for ATM ACs  ....................  33
   12.4      AC Reverse Defect Exit  ...............................  33
   12.4.1    Ethernet AC Procedures  ...............................  33
   12.4.2    Procedures for a FR/ATM PW in the out-of-band method  .  34
   12.4.3    Procedures for a ATM PW in the inband PW method  ......  34
   13        SONET Encapsulation (CEP)  ............................  34
   14        TDM Encapsulation  ....................................  34
   Ap A      Native Service Management  ............................  36
   Ap A.1    Frame Relay Management  ...............................  36
   Ap A.2    ATM Management  .......................................  36
   Ap A.3    Ethernet Management  ..................................  37
   15        Security Considerations  ..............................  39
   16        IANA Considerations  ..................................  39
   17        References  ...........................................  39
   17.1      Normative References  .................................  39
   17.2      Informative References  ...............................  40
   18        Editors' Addresses  ...................................  41
   19        Intellectual Property Statement  ......................  42
   20        Full Copyright Statement  .............................  42
   21        Acknowledgment  .......................................  43









Nadeau, et al.              Standards Track                     [Page 3]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


1. Specification of Requirements

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119.


2. Acknowledgments

   The editors would like to acknowledge the important contributions of
   Hari Rakotoranto, Eric Rosen, Mark Townsley, Michel Khouderchah,
   Bertrand Duvivier, Vanson Lim, Chris Metz, Ben Washam, Tiberiu
   Grigoriu, Neil McGill, and Amir Maleki.


3. Contributing Authors

   The following persons contributed to this document:  Peter B.
   Busschbach (busschbach@alcatel-lucent.com), Mustapha Aissaoui
   (mustapha.aissaoui@alcatel-lucent.com), Matthew Bocci
   (matthew.bocci@alcatel.co.uk),David Watkinson
   (david.watkinson@alcatel-lucent.com), Yuichi Ikejiri
   (y.ikejiri@ntt.com), Kenji Kumaki(kekumaki@kddi.com), Satoru
   Matsushima (satoru.matsushima@tm.softbank.co.jp),David Allan
   (dallan@nortelnetworks.com), Simon Delord (sdelord@uecomm.com.au),
   Vasile Radoaca (vasile.radoaca@alcatel-lucent.com)


4. Introduction

   This document specifies the mapping of defect states between a Pseudo
   Wire and the Attachment Circuits (AC) of the end-to-end emulated
   service. This document covers the case whereby the ACs and the PWs
   are of the same type in accordance to the PWE3 architecture [RFC3985]
   such that a homogeneous PW service can be constructed. This document
   is motivated by the requirements put forth in [RFC4377] and
   [RFC3916].

   Ideally only PW and AC defects need be propagated into the Native
   Service (NS), and NS OAM mechanisms are transported transparently
   over the PW. Some homogeneous scenarios use PW specific OAM
   mechanisms to synchronize defect state between PEs due to
   discontinuities in native service OAM between the AC and the PW (e.g.
   FR LMI).

   The objective of this document is to standardize the behavior of PEs
   with respects to failures on PWs and ACs, so that there is no
   ambiguity about the alarms generated and consequent actions



Nadeau, et al.              Standards Track                     [Page 4]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   undertaken by PEs in response to specific failure conditions.

   This document covers PWE over MPLS PSN, PWE over IP PSN and PWE over
   L2TP PSN.


5. Terminology

      AIS   Alarm Indication Signal
      AC    Attachment circuit
      BDI   Backward Defect Indication
      CC    Continuity Check
      CE    Customer Edge
      CPCS  Common Part Convergence Sublayer
      DLC   Data Link Connection
      FDI   Forward Defect Indication
      FRBS  Frame Relay Bearer Service
      IWF   Interworking Function
      LB    Loopback
      MD    Level Maintenance Domain (MD) Level which identifies
            a value in the range of 0-7 associated with Ethernet
            OAM frame. MD Level identifies the span of the
            Ethernet OAM frame.
      MEP   Maintenance End Point is responsible for origination
            and termination of OAM frames for a given MEG
      MEG   Maintenance Entity Group
      MIP   Maintenance Intermediate Point is located between peer
            MEPs and can process OAM frames but does not initiate
            or terminate them
      NE    Network Element
      NS    Native Service
      OAM   Operations and Maintenance
      PE    Provider Edge
      PW    Pseudowire
      PSN   Packet Switched Network
      RDI   Remote Defect Indication
      SDU   Service Data Unit
      VCC   Virtual Channel Connection
      VPC   Virtual Path Connection

   The rest of this document will follow the following conventions:

   The PW can ride over three types of Packet Switched Network (PSN).  A
   PSN which makes use of LSPs as the tunneling technology to forward
   the PW packets will be referred to as an MPLS PSN. A PSN which makes
   use of MPLS-in-IP tunneling [RFC4023], with an MPLS shim header used
   as PW demultiplexer, will be referred to as an MPLS-IP PSN. A PSN,
   which makes use of L2TPv3 [RFC3931] as the tunneling technology with



Nadeau, et al.              Standards Track                     [Page 5]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   the L2TPv3 Session ID as the PW demultiplexer, will be referred to as
   L2TP-IP PSN.

   If LSP-Ping [RFC4379] is run over a PW as described in [RFC4377], it
   will be referred to as VCCV-Ping.

   If BFD is run over a PW as described in [RFC4377], it will be
   referred to as VCCV-BFD [VCCV-BFD].

   In the context of this document a PE forwards packets between an AC
   and a PW. The other PE that terminates the PW is the peer PE and the
   attachment circuit associated with the far end PW termination is the
   remote AC.

   Defects are discussed in the context of defect states, and the
   criteria to enter and exit the defect state.

   The direction of defects is discussed from the perspective of the
   observing PE and what the PE may explicitly know about information
   transfer capabilities of the PW service.

   A forward defect is one that impacts information transfer to the
   observing PE. It impacts the observing PEs ability to receive
   information. A forward defect MAY also imply impact on information
   sent or relayed by the observer (and as it cannot receive is
   therefore unknowable) and so the forward defect state is considered
   to be a superset of the two defect states.

   A reverse defect is one that uniquely impacts information sent or
   relayed by observer.



6. Reference Model and Defect Locations

   Figure 1 illustrates the PWE3 network reference model with an
   indication of the possible defect locations. This model will be
   referenced in the remainder of this document for describing the OAM
   procedures.












Nadeau, et al.              Standards Track                     [Page 6]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


               ACs             PSN tunnel               ACs
                      +----+                  +----+
      +----+          | PE1|==================| PE2|          +----+
      |    |---(a)---(b)..(c)......PW1..(d)..(c)..(f)---(e)---|    |
      | CE1|   (N1)   |    |                  |    |    (N2)  |CE2 |
      |    |----------|............PW2.............|----------|    |
      +----+          |    |==================|    |          +----+
           ^          +----+                  +----+          ^
           |      Provider Edge 1         Provider Edge 2     |
           |                                                  |
           |<-------------- Emulated Service ---------------->|

     Customer                                                Customer
      Edge 1                                                  Edge 2
                Figure 1: PWE3 Network Defect Locations

   In all interworking scenarios described in this document, it is
   assumed that at PE1 the AC and the PW are of the same type. The
   procedures described in this document exclusively apply to PE1.  PE2
   for a homogeneous service implements the identical functionality
   (although it is not required to as long as the notifications across
   the PWs are consistent).

   The following is a brief description of the defect locations:

        -i. Defect in the first L2 network (N1). This covers any defect
            in the N1 which impacts all or a subset of ACs terminating
            in PE1. The defect is conveyed to PE1 and to the remote L2
            network (N2) using the native service specific OAM defect
            indication.
       -ii. Defect on a PE1 AC interface.
      -iii. Defect on a PE PSN interface.
       -iv. Defect in the PSN network. This covers any defect in the PSN
            which impacts all or a subset of the PSN tunnels and PWs
            terminating in a PE. The defect is conveyed to the PE using
            a PSN and/or a PW specific OAM defect indication. Note that
            control plane, i.e., signaling and routing, messages do not
            necessarily follow the path of the user plane messages.
            Defect in the control plane are detected and conveyed
            separately through control plane mechanisms. However, in
            some cases, they have an impact on the status of the PW as
            explained in the next section.
        -v. Defect in the second L2 network (N2). This covers any defect
            in N2 which impacts all or a subset of ACs terminating in
            PE2 (which is considered a remote AC defect in the context
            of procedures outlined in this draft). The defect is
            conveyed to PE2 and to the remote L2 network (N1) using the
            native service OAM defect indication.



Nadeau, et al.              Standards Track                     [Page 7]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


       -vi. Defect on a PE2 AC interface (which is also considered a
            remote AC defect in the context of this draft).


7. Abstract Defect States

   PE1 is obliged to track four abstract defect states that reflect the
   observed state of both directions of the PW service on both the AC
   and the PW sides. Faults may impact only one or both directions of
   the PW.

   The observed state is a combination of faults directly detected by
   PE1, or faults it has been made aware of via notifications.

                              +-----+
           ----AC forward---->|     |-----PW reverse---->
     CE1                      | PE1 |                       PE2/CE2
           <---AC reverse-----|     |<----PW forward-----
                              +-----+


   (arrows indicate direction of user traffic impacted by a defect)
   Figure 2: Forward and Reverse Defect States and Notifications PE1
   will directly detect or be notified of AC forward and PW forward
   defects as they occur upstream of PE1 and impact traffic being sent
   to PE1.  In Figure 2, PE1 may be notified of a forward defect in the
   AC by receiving a Forward Defect indication, e.g., ATM AIS, from CE1.
   This defect impacts the ability of PE1 to receive user traffic from
   CE1 on the AC. PE1 can also directly detect this defect if it
   resulted from a failure of the receive side in the local port or link
   over which the AC is configured.  Similarly, PE1 may detect or be
   notified of a forward defect in the PW by receiving a Forward Defect
   indication from PE2. This notification can either be a Local PSN-
   facing PW (egress) Transmit Fault or a Local Attachment Circuit
   (ingress) Receive Fault. This defect impacts the ability of PE1 to
   receive user traffic from CE2.  Note that the AC or PW Forward Defect
   notification is sent in the same direction as the user traffic
   impacted by the defect.

   PE1 will only be notified of AC reverse and PW reverse defects as
   they universally will be detected by other devices and only impact
   traffic that has already been relayed by PE1. In Figure 2, PE1 may be
   notified of a reverse defect in the AC by receiving a Reverse Defect
   indication, e.g., ATM RDI, from CE1. This defect impacts the ability
   of PE1 to send user traffic to CE1 on the AC.  Similarly, PE1 may be
   notified of a reverse defect in the PW by receiving a Reverse Defect
   indication from PE2. This notification can either be a Local PSN-
   facing PW (ingress) Receive Fault or a Local Attachment Circuit



Nadeau, et al.              Standards Track                     [Page 8]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   (egress) Transmit Fault. This defect impacts the ability of PE1 to
   send user traffic to CE2.  Note that the AC or PW Reverse Defect
   notification is sent in the reverse direction to the user traffic
   impacted by the defect.

   The procedures outlined in this document define the entry and exit
   criteria for each of the four states with respect to the set of
   potential ACs and PWs within the document scope and the consequent
   actions that PE1 must perform to properly interwork those
   notifications. The abstract defect states used by PE1 are common to
   all potential interworking combinations of PWs and ACs.

   When a PE has multiple sources of notifications from a peer (e.g.
   PSN control plane, LDP control plane, BFD), it is obliged to track
   all sources, but with respect to consequent actions the forward state
   ALWAYS has precedence over the reverse state.


8. PW Status and Defects

   This section describes possible PW defects, ways to detect them and
   consequent actions.


8.1. PW Defects

   Possible defects that impact PWs are the following:

     - Physical layer defect in the PSN interface

     - PSN tunnel failure which results in a loss of connectivity
       between ingress and egress PE.

     - Control session failures between ingress and egress PE

   In case of an MPLS PSN and an MPLS-IP PSN there are additional
   defects:

     - PW labeling error, which is due to a defect in the ingress PE, or
       to an over-writing of the PW label value somewhere along the LSP
       path.

     - LSP tunnel Label swapping errors or LSP tunnel label merging
       errors in the MPLS network. This could result in the termination
       of a PW at the wrong egress PE.






Nadeau, et al.              Standards Track                     [Page 9]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


     - Unintended self-replication; e.g., due to loops or denial-of-
       service attacks.


8.1.1. Packet Loss

   Persistent congestion in the PSN or in a PE could impact the proper
   operation of the emulated service.

   A PE can detect packet loss resulting from congestion through several
   methods. If a PE uses the sequence number field in the PWE3 Control
   Word for a specific Pseudo Wire [RFC3985], it has the ability to
   detect packet loss.  Translation of congestion detection ato PW
   defect states is outside the scope of this specification.

   Generally, there are congestion alarms which are raised in the node
   and to the management system when congestion occurs. The decision to
   declare the PW Down and to select another path is usually at the
   discretion of the network operator.


8.2. Defect Detection and Notification

8.2.1. Defect Detection Tools

   To detect the defects listed above, Service Providers have a variety
   of options available.

   Physical Layer defect detection and notification mechanisms such as
   SONET/SDH LOS, LOF,and AIS/FERF.

   PSN Defect Detection Mechanisms:

   For PWE3 over an L2TP-IP PSN, with L2TP as encapsulation protocol,
   the defect detection mechanisms described in [RFC3931] apply.  This
   includes for example the keepalive mechanism performed with Hello
   messages for detection of loss of connectiviry between a pair of
   LCCEs (i.e., dead PE peer and path detection).  Furthermore, the
   tools Ping and Traceroute, based on ICMP Echo Messages apply [RFC792]
   and can be used to detect defects on the IP PSN.  Additionally, ICMP
   Ping [RFC5085] and BFD [VCCV-BFD] can also be used with VCCV to
   detect defects at the individual pseudowire level.

   For PWE3 over an MPLS PSN and an MPLS-IP PSN, several tools can be
   used.






Nadeau, et al.              Standards Track                    [Page 10]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


     - LSP-Ping and LSP-Traceroute( [RFC4379]) for LSP tunnel
       connectivity verification.

     - LSP-Ping with Bi-directional Forwarding Detection ([BFD]) for LSP
       tunnel continuity checking.

     - Furthermore, if RSVP-TE is used to setup the PSN Tunnels between
       ingress and egress PE, the hello protocol can be used to detect
       loss of connectivity [RFC3209], but only at the control plane.

   PW specific defect detection mechanisms:

   [RFC4377] describes how LSP-Ping and BFD can be used over individual
   PWs for connectivity verification and continuity checking
   respectively. When used as such, we will refer to them as VCCV-Ping
   and VCCV-BFD respectively.

   Furthermore, the detection of a fault could occur at different points
   in the network and there are several ways the observing PE determines
   a fault exists:
        -i. egress PE detection of failure (e.g. BFD)
       -ii. ingress PE detection of failure (e.g. LSP-PING)
      -iii. ingress PE notification of failure (e.g. RSVP Path-err)


8.2.2. Defect

   The discussion below is intended to give some perspective how tools
   mentioned in the previous section can be used to detect failures.

   Observations:

     - Tools like LSP-Ping and BFD can be run periodically or on demand.
       If used for defect detection, as opposed to diagnostic usage,
       they must be run periodically. Control protocol failure
       indications, e.g. detected through L2TP Keepalive (Hello)
       messages or the RSVP-TE Hello messages, can be used to detect
       many network failures. However, control protocol failures do not
       necessarily coincide with data plane failures. Therefore, a
       defect detection mechanism in the data plane is required to
       protect against all potential data plane failures. Furthermore,
       fault diagnosis mechanisms for data plane failures are required
       to further analyze detected failures.

     - For PWE3 over an MPLS PSN and an MPLS-IP PSN, it is effective to
       run a defect detection mechanism over a PSN Tunnel frequently and
       run one over every individual PW within that PSN Tunnel less
       frequently. However in case the PSN traffic is distributed over



Nadeau, et al.              Standards Track                    [Page 11]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


       Equal Cost Multi Paths (ECMP), it may be difficult to guarantee
       that PSN OAM messages follow the same path as a specific PW. A
       Service Provider might therefore decide to focus on defect
       detection over PWs.

     - In MPLS networks, execution of LSP Ping would detect MPLS label
       errors, since it requests the receiving node to match the label
       with the original FEC that was used in the LSP set up. BFD can
       also be used since it relies on discriminators. A label error
       would result in a mismatch between the expected discriminator and
       the actual discriminator in the BFD control messages.

     - For PWE3 over an MPLS PSN and an MPLS-IP PSN, PEs could detect
       PSN label errors through the execution of LSP-Ping. However, use
       of VCCV is preferred as it is a more accurate detection tool for
       pseudowires.  Furthermore, it can be run using a BFD mode, i.e.,
       VCCV-BFD, which allows it to be used as a light-weight detection
       mechanism for PWs. If, due to a label error in the PSN, a PW
       would be terminated on the wrong egress PE, PEs would detect this
       through the execution of VCCV. LSP ping and/or LSP trace could
       then be used to diagnose the detected failure.  Based on these
       observations, it is clear that a service provider has the
       disposal of a variety of tools. There are many factors that
       influence which combination of tools best meets its needs.


8.3. Overview of fault notifications

   For a MPLS PSN and a IP PSN using MPLS-in-IP [RFC4023], a PW that are
   established and maintained using LDP SHOULD use LDP status signaling
   messages as the default mechanism for AC, PW status and defect
   notification [RFC4447]. If a combination of VCCV+BFD [RFC4377] status
   then LDP status MUST not be used, as outlined in [VCCV-BFD] section
   3. For PWs established using other means such as static
   configuration, in-band signaling using VCCV-BFD [RFC5085] SHOULD be
   used to convey AC and PW status.

   For a IP PSN using L2TPv3, i.e., a L2TP-IP PSN, StopCCN is used to
   shutdown the control connection (and implicitly all sessions
   associated with that control connection without any explicit session
   control messages) and CDN messages are used to disconnect a specific
   pseudowire session. In its most basic form, the Circuit Status AVP
   [RFC3931] in a Set-Link-Info (SLI) message can signal active/inactive
   AC status.

   As described in [L2TP-Status], a Circuit Status AVP in an SLI message
   can also be used to convey status and defects in the AC and the PSN-
   facing PW in both ingress and egress directions (i.e., four



Nadeau, et al.              Standards Track                    [Page 12]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   independent status bits), as well as providing "standby" indication,
   without the need to tear down the sessions or control connection.
   Additionally, BFD [VCCV-BFD] can be used to signal status for L2TP-IP
   PWs, but the L2TPv3 status conveyed through the Circuit Status AVP
   MUST take precedence over the VCCV-BFD status (see Section 5.3.4 and
   Section 3.3 of [VCCV-BFD]).


8.3.1. Use of Native Service notifications

   In the context of this document, ATM and unstructured SONET/TDM PWs
   are the only examples of a PW that has native service notification
   capability. Frame relay does have the FR OAM specification [FRF.19],
   but this is not commonly deployed. All other PWs use PW specific
   notification mechanisms.

   ATM PWs may optionally also use PW specific notification mechanisms.

   In normal, i.e., defect-free, operation, all the types of ATM OAM
   cells described in Section 12.2 are either terminated at the PE, for
   OAM segments terminating in the AC endpoint, or transparently carried
   over the PSN tunnel [RFC4717] [RFC4454]. This is referred to as in-
   band ATM OAM over PW and is the default method.

   An optional out-of band method based on relaying the ATM defect state
   over a PW specific defect indication mechanism is provided for PEs
   which cannot generate and/or transmit ATM OAM cells over the ATM PW.
   This is referred to as Out-of-band ATM OAM over PW.

   Ethernet Link OAM [802.3] allows some Link defect states to be
   detected and communicated across an Ethernet Link. When an Ethernet
   AC is an Ethernet PHY, there may be some application of Ethernet Link
   OAM [802.3]. Further, E-LMI [MEF.16] also allows for some EVC defect
   states to be communicated across an Ethernet UNI where Ethernet UNI
   constitutes a single hop Ethernet Link (i.e. without any 802.1Q/.1ad
   compliant bridges in between). There may be some application of E-LMI
   [MEF.16] for failure notification across single hop Ethernet AC in
   certain deployments that specifically do not support [802.1ag] and/or
   [Y.1731]. [Y.1731] and [802.1ag] based mechanisms are applicable in
   all types of Ethernet ACs. Ethernet Link OAM [802.3] and E-LMI
   [MEF.16] are optional and their applicability is called out, where
   applicable.

   Native Service (NS) OAM may be transported transparently over the
   corresponding PW as user data. For Ethernet, as an example, 802.1ag
   continuity check messages (CCMs) between two Maintenance End Points
   (MEPs) can be transported transparently as user data over the
   corresponding PW. At MEP locations, service failure is detected when



Nadeau, et al.              Standards Track                    [Page 13]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   a number of consecutive CCMs are missed. MEP locations can be the PE,
   the CE or both with different Maintenance Domain Levels. However,
   when interworking two networking domains, such as native Ethernet and
   PWs to provide an end-to-end emulated service, there is need to
   identify the failure domain and location even when a PE supports both
   the NS OAM mechanisms and the PW OAM mechanisms. In addition,
   scalability constraints may not allow running proactive monitoring,
   such as CCMs with transmission on, at a PE to detect the failure of
   an Ethernet Virtual circuit (EVC) across the PW domain. Thus, network
   driven alarms generated upon failure detection in the NS or PW domain
   and their mappings to the other domain are needed. There are also
   cases where a PE may not be able to process NS OAM messages received
   on the PW even when such messages are defined, as in Ethernet case,
   necessitating the need for fault notification message mapping between
   the PW domain and the Client domain.


8.3.2. Use of Ethernet Native Service notifications

   There is no NS fault notification capability currently specified for
   Ethernet PWs. However, with the completion of Ethernet OAM work, this
   capability should be added. This includes the ability to create a MEP
   associated with the Ethernet PW on the PE. The native service
   notification options include:

     - AIS Frames sent by the local MEP to the MEP on the remote PE when
       the MEP needs to convey PE forward defects, and when CCM
       transmission is configured not to be turned ON.
     - Suspension of CCM frames transmission from the MEP to the peer
       MEP on the other PE to convey PE forward defects, when CCM
       transmission is configured to be turned ON.
     - RDI in transmitted CCM frames, when loss of CCMs from the peer
       MEP is detected or PE needs to convey PW reverse defects.

   These NS OAM notifications are inserted into the corresponding PW.

   Similarly, when the defect conditions are cleared, a PE can take one
   of the following actions, depending on the mechanism that was used
   for failure notification, to clear the defect sate on the peer PE:

     - Stop AIS Frame transmission from the local MEP to the MEP on the
       remote PE to clear PW forward defects;
     - Resuming CCM frames transmission from the MEP to the peer MEP to
       clear PW forward defects notification, when CCM transmission is
       configured to be turned ON.






Nadeau, et al.              Standards Track                    [Page 14]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


     - Clearing RDI indication in transmitted CCM frames, to clear PW
       reverse defects notification.


8.3.3. The Use of PW Status for MPLS and MPLS-IP PSNs

   [RFC4446] defines the following valid PW status code points.
   [RFC4447] specifies that Pseudo Wire forwarding is used to clear all
   faults and that Pseudo Wire Not Forwarding is used to convey any
   other defects that cannot be represented by the other code points.
   The remaining code points map to the forward defect and reverse
   defect defined in this document as follows:
        Forward defect - corresponds to the logical OR of
                         Local Attachment Circuit (ingress)
                         Receive Fault and Local PSN-facing
                         PW (egress) Transmit Fault

        Reverse defect - corresponds to the logical OR of
                         Local Attachment Circuit (egress)
                         Transmit Fault and Local PSN-facing
                         PW (ingress) Receive Fault

   PW status is used to convey the defect view of the PW local to the
   originating PE. This is the local PW state. This state is conveyed
   in the form of a forward defect or a reverse defect.

   Thus PW status (when available) shall be used to report the
   following failures:

     - Failures detected through defect detection mechanisms in the MPLS
       and MPLS-IP PSN

     - Failures detected through VCCV-Ping

     - Failures within the PE that result in an inability to forward
       traffic between ACs and PW

     - State of the AC when the PE does not have native service OAM
       capability or emulation of native service OAM capability is
       prohibitive. This state is conveyed in the form of a forward
       defect or a reverse defect.

   Note that there are a couple of situations which require PW label
   withdrawal as opposed to a PW status notification by the PE. The
   first one is when the PW is taken administratively down in accordance
   to [RFC4447]. The second one is when the Target LDP session
   established between the two PEs is lost. In the latter case, the PW
   labels will need to be re-signaled when the Targeted LDP session is



Nadeau, et al.              Standards Track                    [Page 15]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   re-established.


8.3.4. The Use of the L2TP Circuit Status AVP

   [RFC3931] defines the Circuit Status AVP in the Set-Link-Info (SLI)
   message to exchange initial status and status changes in the circuit
   to which the pseudowire is bound. [L2TP-Status] defines extensions to
   the Circuit Status AVP that are analogous to the PW Status AVP
   defined for LDP.  Consequently, for L2TP-IP, the Circuit Status AVP
   is used in the same fashion as the PW Status described in the
   previous section.

   If the extended Circuit Status bits are not supported, and instead
   only the "A-bit" (Active) is used as described in [RFC3931], CDN
   messages can be used to clear L2TPv3 sessions in the presence of
   session-level failures detected in the L2TP-IP PSN.

   L2TPv3 pseudowires also support the use of BFD over VCCV to convey
   status information. If used, AC and PW status and defect notification
   using the Circuit Status AVP take precedence over VCCV-BFD status
   (see Section 3.3 of [VCCV-BFD]). For L2TP-IP PWs that do not use
   L2TPv3 signaling or are set up statically, VCCV-BFD should be used to
   convey AC and PW status.

   The Active bit set in the Circuit Status is used to clear all faults,
   and the Active bit clear in the Circuit Status is used to convey any
   defect that cannot be represented explicitly with specific Circuit
   Status flags from [RFC3931] or [L2TP-Status].  The forward and
   reverse defect definitions are mapped from [L2TP-Status] as follows:

        Forward defect - corresponds to the logical OR of
                         Local Attachment Circuit (ingress)
                         Receive Fault and Local PSN-facing
                         PW (egress) Transmit Fault

        Reverse defect - corresponds to the logical OR of
                         Local Attachment Circuit (egress)
                         Transmit Fault and Local PSN-facing
                         PW (ingress) Receive Fault

   The status notification represents the local view of the originating
   LCCE (PE).

   The Circuit Status is used to report the following failures when
   using the extended definition of [L2TP-Status]:





Nadeau, et al.              Standards Track                    [Page 16]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


     - Failures detected through defect detection mechanisms in the
       L2TP-IP PSN.

     - Failures detected though VCCV (pseudowire level)

     - Failures within the PE that result in an inability to forward
       traffic between ACs and PW

     - State of the AC when the PE does not have native service OAM
       capability or emulation of native service OAM capability is
       prohibitive. This state is conveyed in the form of a forward
       defect or a reverse defect.

   When the extended Circuit Status definition of [L2TP-Status] is not
   used, the A-bit in the Circuit Status AVP in SLI is used to report:

     - Failures of the ACs

   When the extended Circuit Status definition of [L2TP-Status] is not
   used, the CDN and StopCCN messages are used in a similar way to an
   MPLS PW label withdrawal to report:

     - Failures detected through defect detection mechanisms in the
       L2TP-IP PSN (using StopCCN)

     - Failures detected through VCCV (pseudowire level) (using CDN)

     - Failures within the PE that result in an inability to forward
       traffic between ACs and PW (using CDN)

   For ATM L2TPv3 pseudowires, in addition to the Circuit Status AVP,
   the ATM Alarm Status AVP [RFC4454] is used to indicate the reason for
   the ATM circuit status and the specific alarm type, if any.  This AVP
   is sent in the SLI message to indicate additional information about
   the ATM circuit status.

   L2TP control connections use Hello messages as a keepalive facility.
   It is important to note that if a PSN failure is such that the loss
   of conectivity is detected when it triggers a keepalive timeouts, the
   control connection is cleared.  L2TP Hello messages are sent in-band
   with the dataplane, with respect to the source and destination
   addresses, IP protocol number and UDP port (when UDP is used).









Nadeau, et al.              Standards Track                    [Page 17]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


8.3.5. The Use of BFD Diagnostic Codes

   [BFD] defines a set of diagnostic codes that partially overlap with
   failures that can be communicated through PW Status messages or L2TP
   Circuit Status AVP. This section describes the behavior of the PE
   nodes with respect to using one or both methods for detecting and
   propagating defect state.

   For a MPLS-PSN, the PEs negotiate the use of the VCCV capabilities
   when the label mapping messages are exchanged to establish the two
   directions of the PW. An OAM capability TLV is signaled as part of
   the PW FEC interface parameters TLV.  For L2TP-IP PSNs, the PEs
   negotiate the use of VCCV during the pseudowire session
   initialization using the VCCV AVP. See [RFC5085] and [VCCV-BFD].

   The CV Type Indicators field in this TLV defines a bitmask used to
   indicate the specific OAM capabilities that the PE can make use of
   over the PW being established. A CV type of 0x04 or 0x10 indicates
   that BFD is used for PW fault detection only, see Section 3.3 of
   [VCCV-BFD].

   In this mode, only two of the diagnostic (Diag) codes specified in
   [BFD] will be used, they are:

   0 - No diagnostic:
   1 - Control detection time expired
   7 - Administratively Down

   The first code indicates that the peer PE is correctly receiving BFD
   control messages. The second code indicates that the peer has stopped
   receiving BFD control messages. A PE shall use "Administrative down"
   to bring down the BFD session when the PW is brought down
   administratively. All other defects - such as AC defects and PE
   internal failures that prevent it from forwarding traffic - must be
   communicated through PW Status messages, in the case of MPLS PSN or
   MPLS-IP PSN, or the appropriate L2TP codes in the Circuit Status AVP
   in the case of L2TP-IP PSN, as defined in 5.3.2 and 5.3.3.

   A CV type of 0x08 or 0x20 in the OAM capabilities TLV indicates that
   BFD is used for both PW fault detection and AC/PW Fault Notification.
   In this case, all defects - including AC defects and PE internal
   failures - are signaled through BFD, using the following diagnistic
   (Diag) codes specified in [BFD]:

   6 -- Concatenated Path Down
   8 -- Reverse Concatenated Path Down

   BFD diagnostic codes 6 and 8 are used to signal AC forward and



Nadeau, et al.              Standards Track                    [Page 18]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   reverse defect states respectively when the PEs negotiated the use of
   BFD as the mechanism for AC and PW fault detection and status
   signaling notification.



9. PW Defect State Entry/Exit

9.1. PW Forward Defect Entry/Exit

   A PE will enter the PW forward defect state if one of the following
   occurs:

     - It detects loss of connectivity on the PSN tunnel over which the
       PW is riding. This includes label swapping errors and label
       merging errors.

     - It receives a message from PE2 indicating PW forward defect or PW
       not forwarding, which indicates PE2 detected or was notified of a
       PW fault downstream of it or that there was a remote AC fault.

     - It detects a loss of PW connectivity, including label errors,
       through VCCV-BFD or VCCV-PING in no reply mode.

   Note that if the PW control session between the PEs fails, the PW is
   torn down and needs to be re-established. However, the consequent
   actions towards the ACs are the same as if the PW entered the forward
   defect state.

   PE1 will exit the forward defect state if the PW status received from
   PE2 has the forward defect indication cleared, and it has established
   that PW/PSN connectivity is working in the forward direction. Note
   that this may result in a transition to the PW operational or PW
   reverse defect states.

   For a PWE3 over a L2TP-IP PSN, a PE will exit the PW forward defect
   state when the following conditions are true:

     - All defects it had previously detected have disappeared, and

     - A L2TPv3 session is successfully established to carry the PW
       packets.









Nadeau, et al.              Standards Track                    [Page 19]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


9.2. PW reverse defect state entry/exit

   A PE will enter the PW reverse defect state if it receives a message
   from PE2 indicating PW reverse defect which indicates PE2 detected or
   was notified of a PW/PSN fault upstream of it or that there was a
   remote AC fault and it is not already in the PW forward defect state.

   PE1 will exit the reverse defect state if the PW status received from
   PE2 contains the reverse defect indication cleared, or it has entered
   the PW forward defect state.

   For a PWE3 over a L2TP-IP PSN, the PW reverse defect state is not
   valid and a PE can only enter the PW forward defect state.


9.2.1. PW reverse defects with PE state synchronization

   Some PW mechanisms will result in PW defects being detected by or
   notified to PE1 when PE1 is upstream of the fault but the
   notification did not originate with PE2. The resultant actions are
   identical to that of entering the PW reverse defect state with the
   addition that PE1 needs to synchronize state with PE2 and the PW
   state communicated from PE1 to PE2 needs to indicate state
   accordingly.

   When the PSN uses RSVP-TE or proactively uses LSP-PING as a PW fault
   detection mechanism, PE1 must enter to the PW reverse defect state.

   The exit criteria being when, the RSVP fault state or the LSP-PING
   fault state exit criteria has been met, indicating no PW reverse
   defects.


10. AC Defect States

10.1. Ethernet AC

10.1.1. AC

   PE1 enters the AC forward defect state if any of the following
   conditions are met:

     - It detects or is notified of a physical layer fault on the
       Ethernet interface. Ethernet link failure can be detected based
       on loss of signal (LoS) or via Ethernet Link OAM [802.3] critical
       link event notifications generated at an upstream node CE1 with
       "Dying Gasp" or "Critical Event" indication.




Nadeau, et al.              Standards Track                    [Page 20]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


     - A MEP associated with the local AC receives an Ethernet AIS
       frame.
     - A MEP associated with the local AC does not receive CCM frames
       from the peer MEP in the client domain (e.g. CE1) within a
       configurable interval equal to a multiple (e.g. 3.5) of the CCM
       transmission period configured for the MEP. This is the case when
       CCM transmission is configured to be turned ON.

   PE1 exits the AC forward defect state if all of the conditions that
   resulted in entering the defect state are cleared. This includes all
   of the following conditions:

     - Any physical layer fault on the Ethernet interface, if detected
       or notified previously, is removed (e.g. via loss of signal
       (LoS), or Ethernet Link OAM [802.3] critical link event
       notifications with "Dying Gasp" or "Critical Event" indication
       cleared at an upstream node CE1).
     - A MEP associated with the local AC does not receive any Ethernet
       AIS frame within a period indicated by previously received AIS,
       if AIS was resulted in entering the defect state.
     - A MEP associated with the local AC and configured with CCM
       transmission on receives a configured number (e.g. 3 or more) of
       consecutive CCM frames from the peer MEP on CE1 within an
       interval equal to a multiple (e.g. 3.5) of the CCM transmission
       period configured for the MEP.


10.1.2. AC Reverse Defect State Entry or Exit

   PE1 enters the AC reverse defect state if any of the following
   condition is met:

     - It detects or is notified of a physical layer fault on the
       Ethernet interface (e.g. via loss of signal (LoS) or Ethernet
       Link OAM [802.3] critical link event notifications generated at
       an upstream node CE1 with "Link Fault" indication).
     - A MEP configured with CCM transmission turned ON and associated
       with the local AC receives a CCM frame, with its RDI bit set,
       from peer MEP in the client domain (e.g. CE1).

   PE1 exits the AC reverse defect state if all of the conditions that
   resulted in entering the defect state are cleared. This includes all
   of the following conditions:

     - Any physical layer fault on the Ethernet interface, if detected
       or notified previously, is removed (e.g. via Ethernet Link OAM
       [802.3] critical link event notifications with "Link Fault"
       indication cleared at an upstream node CE1).



Nadeau, et al.              Standards Track                    [Page 21]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


     - A MEP configured with CCM transmission turned ON and associated
       with the local AC does not receive a CCM frame with RDI bit set,
       having received a previous CCM frame with RDI bit set from the
       peer MEP in the client domain (e.g. CE1).


10.2. FR ACs

   PE1 enters the AC Forward Defect state if any of the following
   conditions are met:
        -i. A PVC is not deleted from the Frame Relay network and the
            Frame Relay network explicitly indicates in a full status
            report (and optionally by the asynchronous status message)
            that this Frame Relay PVC is inactive. In this case, this
            status maps across the PE to the corresponding PW only.

       -ii. The LIV indicates that the link from the PE to the Frame
            Relay network is down. In this case, the link down
            indication maps across the PE to all corresponding PWs.
      -iii. A physical layer alarm is detected on the FR interface. In
            this case, this status maps across the PE to all
            corresponding PWs. A PE exits the AC Forward Defect state
            when all defects it had previously detected have
            disappeared.

   The AC reverse defect state is not valid for FR ACs.


10.3. ATM ACs

10.3.1. AC Forward Defect State Entry/Exit

   PE1 enters the AC forward defect state if any of the following
   conditions are met:
        -i. It detects or is notified of a physical layer fault on the
            ATM interface and/or it terminates an F4 AIS flow or has
            loss of F4 CC for a VP carrying VCCs.
       -ii. It terminates an F4 AIS OAM flow, in the case of a VPC, or
            an F5 AIS OAM flow, in the case of a VCC, indicating that
            the ATM VPC or VCC is down in the adjacent L2 ATM network
            (e.g., N1 for PE1). This is applicable to the case of the
            out-of-band ATM OAM over PW method only.
      -iii. It detects loss of connectivity on the NS ATM VPC/VCC while
            terminating ATM continuity checking (ATM CC) with the local
            ATM network and CE.

   A PE exits the AC Forward Defect state when all defects it had
   previously detected have disappeared. The exact conditions under



Nadeau, et al.              Standards Track                    [Page 22]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   which a PE exits the AIS state, or declares that connectivity is
   restored via ATM CC are defined in I.610 [I.610].


10.3.2. AC Reverse Defect State Entry/Exit

   A PE enters the AC reverse defect state if any of the following
   conditions are met:
        -i. It terminates an F4 RDI OAM flow, in the case of a VPC, or
            an F5 RDI OAM flow, in the case of a VCC, indicating that
            the ATM VPC or VCC is down in the adjacent L2 ATM network
            (e.g., N1 for PE1). This is applicable to the case of the
            out-of-band ATM OAM over PW method only.

   A PE exits the AC Reverse Defect state if the AC state transitions to
   working or to the AC forward defect state. The criteria for exiting
   the RDI state are described in I.610.


11. PW Forward Defect Entry/Exit procedures

11.1. Procedures in FR Port Mode

   In case of pure port mode, STATUS ENQUIRY and STATUS messages are
   transported transparently over the PW. A PW Failure will therefore
   result in timeouts of the Q.933 link and PVC management protocol at
   the Frame Relay devices at one or both sites of the emulated
   interface.


11.2. Procedures in ATM Port Mode

   In case of transparent cell transport, i.e., "port mode", where the
   PE does not keep track of the status of individual ATM VPCs or VCCs,
   a PE cannot relay PW defect state over these VCCs and VPCs. If ATM CC
   is run on the VCCs and VPCs end-to-end (CE1 to CE2), or on a segment
   originating and terminating in the ATM network and spanning the PSN
   network, it will timeout and cause the CE or ATM switch to enter the
   ATM AIS state.












Nadeau, et al.              Standards Track                    [Page 23]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


11.3. PW Forward Defect Entry Procedures

11.3.1. Ethernet AC Procedures

   When the PW status on PE1 transitions from working to PW forward
   defect state; PE1's ability to receive user traffic from CE2 is
   impacted. As a result, PE1 needs to notify CE1 about this problem.

   Upon entry to the PW Forward Defect State, the following must be
   done:
        -i. If PE1 is configured with a MEP associated with the local AC
            and CCM transmission is not configured to be turned ON, the
            MEP associated with the AC must transmit AIS frames
            periodically to the MEP in the client domain (e.g. on CE1)
            based on configured AIS transmission period.
       -ii. If PE1 is configured with a MEP associated with the local AC
            and CCM transmission is configured to be turned ON, and the
            MEP associated with the AC is configured to support
            Interface Status TLV in CCM messages, the MEP associated
            with the AC must transmit CCM frames with Interface Status
            TLV as being down to the peer MEP in the client domain (e.g.
            on CE1).
      -iii. If PE1 is configured with a MEP associated with the local AC
            and CCM transmission is configured to be turned ON, and the
            MEP associated with the AC is configured to not support
            Interface Status TLV in CCM messages, the MEP associated
            with the AC must stop transmitting CCM frames to the peer
            MEP in the client domain (e.g. on CE1).
       -iv. If PE1 is configured to run E-LMI [MEF.16] with CE1 and if
            E-LMI is used for failure notification, PE1 must transmit
            E-LMI asynchronous STATUS message with report type Single
            EVC Asynchronous Status indicating that PW is Not Active.

   Further, when PE1 enters the forward defect state, it must assume
   that PE2 has no knowledge of the defect and must send reverse defect
   failure notification to PE2. For MPLS PSN or MPLS-IP PSN, this is
   done via either a PW Status notification message indicating a reverse
   defect; or via VCCV-BFD diagnostic code of reverse defect if VCCV CV
   type of 0x08 or 0x20 (fault detection and status signaling modes) had
   been negotiated. When Native Service OAM mechanism is supported on
   PE, it can also use the NS OAM notification.

   If PW forward defect is entered as a result of a forward defect
   notification from PE2 or via loss of control adjacency, no additional
   action is needed since PE2 is expected to be aware of the defect.

   Note: The location of the MEP associated with the local AC within a
   PE can be a down MEP on the port associated with the AC or an Up MEP



Nadeau, et al.              Standards Track                    [Page 24]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   associated with an emulated LAN interface within the PE, as defined
   in L2VPN framework for a VPLS PE. Though for the purposes of VPWS
   service, VPLS PE architecture is not mandatory, the VPLS PE
   architecture serves as a generic case where the PE can support both
   VPWS and VPLS services.


11.3.2. FR AC procedures

   These procedures are applicable only if the transition from the
   working state to the PW Forward defect state. A transition from PW
   reverse defect state to the forward defect state does not require any
   additional notification procedures to the FR AC as it has already
   been told the peer is down.
        -i. PE1 MUST generate a full status report with the Active bit =
            0 (and optionally in the asynchronous status message), as
            per Q.933 annex A, into N1 for the corresponding FR ACs.


11.3.3. ATM AC procedures

   The following text refers to AIS, RDI and CC without specifying
   whether it it is an F4 (VP-level) flow or an F5 (VC-level) flow, or
   whether it is an end-to-end or a segment flow.  Precise ATM OAM
   procedures are specified elsewhere (e.g. I.610) and such references
   complement the descriptions below.

   Note that it is a network operator option to support segment OAM and
   to identify and provision PEs as segment end points.

   On entry to the PW Forward Defect State:
        -i. PE1 MUST commence AIS insertion into the corresponding AC.
       -ii. PE1 MUST terminate any CC generation on the corresponding
            AC.


11.3.4. Additional procedures for a FR PW, and an ATM PW

   If the PW failure was explicitly detected by PE1, it MUST assume PE2
   has no knowledge of the defect and MUST notify PE2 in the form of a
   reverse defect notification:

   For PW over MPLS PSN or MPLS-IP PSN:
        -i. A PW Status message indicating a reverse defect, or
       -ii. A VCCV-BFD diagnostic code if the optional use of VCCV-BFD
            notification has been negotiated

   For PW over L2TP-IP PSN



Nadeau, et al.              Standards Track                    [Page 25]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


        -i. An L2TP Set-Link Info (SLI) message with a Circuit Status
            AVP indicating "active" Or,
       -ii. A VCCV-BFD diagnostic code if the optional use of VCCV-BFD
            notification has been negotiated

   Otherwise the entry to the defect state was the result of a
   notification from PE2 (indicating that PE2 already had knowledge of
   the fault) or loss of the control adjacency (similarly visible to
   PE2).


11.4. PW Forward Defect Exit Procedures

11.4.1. Ethernet AC Procedures

   When the PW status transitions from PW forward defect state to
   working, PE1's ability to receive user traffic from CE2 is restored.
   As a result, PE1 needs to cease defect notification to CE1 by
   performing the following:
        -i. If PE1 is configured with a a MEP associated with the local
            AC and CCM transmission is not configured to be turned ON,
            the MEP associated with the AC must stop transmitting AIS
            frames towards the peer MEP in the client domain (e.g. on
            CE1).
       -ii. If PE1 is configured with a MEP associated with the local AC
            and CCM transmission is configured to be turned ON, and the
            MEP associated with the AC is configured to support
            Interface Status TLV in CCM messages, the MEP associated
            with the AC must transmit CCM frames with Interface Status
            TLV as being Up to the peer MEP in the client domain (e.g.
            on CE1).
      -iii. If PE1 is configured with a MEP associated with the local AC
            and CCM transmission is configured to be turned ON, and the
            MEP associated with the AC is configured to not support
            Interface Status TLV in CCM messages, the MEP associated
            with the AC must resume transmitting CCM frames to the peer
            MEP in the client domain (e.g. on CE1).
       -iv. If PE1 is configured to run E-LMI [MEF.16] with CE1 and E-
            LMI is used for fault notification, PE1 must transmit E-LMI
            asynchronous STATUS message with report type Single EVC
            Asynchronous Status indicating that PW is Active.

   Further, if the PW forward defect was explicitly detected by PE1, it
   must now notify PE2 about clearing of forward defect state by
   clearing reverse defect notification. For PWs over MPLS PSN or MPLS-
   IP PSN, this is either done via PW Status message indicating working;
   or via VCCV-BFD diagnostic code if VCCV CV type of 0x08 or 0x20
   (fault detection and status signaling modes) had been negotiated.



Nadeau, et al.              Standards Track                    [Page 26]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   When Native Service OAM mechanism is supported on PE, it can also
   clear the NS OAM notification.

   If PW forward defect was established via notification from PE2 or via
   loss of control adjacency, no additional action is needed, since PE2
   is expected to be aware of the defect clearing.


11.4.2. FR AC procedures

   On transition from the PW forward defect state to the reverse defect
   state PE1 takes no action w.r.t. the AC. On exit from the PW Forward
   defect state:
        -i. PE1 MUST generate a full status report with the Active bit =
            1 (and optionally in the asynchronous status message), as
            per Q.933 annex A, into N1 for the corresponding FR ACs.


11.4.3. ATM AC procedures

   On exit from the PW Forward Defect State:
        -i. PE1 MUST cease AIS insertion into the corresponding AC.
       -ii. PE1 MUST resume any CC generation on the corresponding AC.


11.4.4. Additional procedures for a FR PW, and a  ATM PW

   If the PW failure was explicitly detected by PE1, it MUST notify PE2
   in the form of clearing the reverse defect notification:

   For PW over MPLS PSN or MPLS-IP PSN:
        -i. A PW Status message with the reverse defect indication
            clear, and the remaining indicators showing either working
            or a transition to the forward defect state. Or,
       -ii. A VCCV-BFD diagnostic code with the same attribute as (i) if
            the optional use of VCCV-BFD notification has been
            negotiated
   For PW over L2TP-IP PSN:
        -i. An L2TP Set-Link Info (SLI) message with a Circuit Status
            AVP indicating "active" Or,
       -ii. A VCCV-BFD diagnostic code with the same attributes as (i)
            if the optional use of VCCV-BFD notification has been
            negotiated








Nadeau, et al.              Standards Track                    [Page 27]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


11.5. PW Reverse Defect Entry Procedures

11.5.1. Ethernet AC Procedures

   When the PW status transitions from working to PW reverse defect
   state, PE1's ability to transmit user traffic to CE2 is impacted. As
   a result, PE needs to notify CE1 about this problem which has been
   detected by PE1.

   Upon entry to the PW Reverse Defect State, the following must be
   done:
        -i. If PE1 is configured with a MEP associated with the local AC
            and CCM transmission is configured to be turned ON, the MEP
            associated with the AC must set the RDI bit in transmitted
            CCM frames sent to the peer MEP in the client domain (e.g.
            on CE1).
       -ii. If PE1 is configured to run E-LMI [MEF.16] with CE1 and E-
            LMI is used for fault notification, PE1 must transmit E-LMI
            asynchronous STATUS message with report type Single EVC
            Asynchronous Status indicating that PW is Not Active.


11.5.2. FR AC procedures

   On transition from the PW forward defect state to the reverse defect
   state PE1 takes no action w.r.t. the AC.

   On entry to the PW reverse defect state
        -i. PE1 MUST generate a full status report with the Active bit =
            0 (and optionally in the asynchronous status message), as
            per Q.933 annex A, into N1 for the corresponding FR ACs.


11.5.3. ATM AC procedures

   On entry to the PW Reverse Defect State:
        -i. PE1 MUST commence RDI insertion into the corresponding AC.
            This applies to the case of an ATM PW in the out-of- band
            ATM OAM over PW method only.












Nadeau, et al.              Standards Track                    [Page 28]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


11.6. PW Reverse Defect Exit Procedures

11.6.1. Ethernet AC Procedures

   When the PW status transitions from PW reverse defect state to
   working, PE1's ability to transmit user traffic to CE2 is restored.
   As a result, PE1 needs to cease defect notifications to CE1 and
   perform the following
        -i. If PE1 is configured with a MEP associated with the local AC
            and CCM transmission is configured to be turned ON, the MEP
            associated with the AC must clear the RDI bit in the
            transmitted CCM frames to the peer MEP (e.g. on CE1).
       -ii. If PE1 is configured to run E-LMI [MEF.16] with CE1, PE1
            must transmit E-LMI asynchronous STATUS message with report
            type Single EVC Asynchronous Status indicating that PW is
            Active.


11.6.2. FR AC procedures

   On transition from the PW reverse defect state to the PW forward
   defect state PE1 takes no action with respect to the AC.  On exit
   from the PW Reverse defect state:
        -i. PE1 MUST generate a full status report with the Active bit =
            1 (and optionally in the asynchronous status message), as
            per Q.933 annex A, into N1 for the corresponding FR ACs.


11.6.3. ATM AC procedures

   On exit from the PW Reverse Defect State:
        -i. PE1 MUST cease RDI insertion into the corresponding AC. This
            applies to the case of an ATM PW in the out-of-band ATM OAM
            over PW method only.


12. AC Defect Entry/Exit Procedures

12.1. AC Forward Defect Entry

   On entry to the forward defect state, PE1 may need to perform
   procedures on both the PW and the AC.









Nadeau, et al.              Standards Track                    [Page 29]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


12.1.1. Procedures for an Ethernet PW

   When AC status transitions from working to AC Forward defect state,
   PE1's ability to receive user traffic from CE1 is impacted. As a
   result, PE1 needs to notify PE2 and CE1 about this problem.

   If the AC Forward defect is detected by PE1, it must notify PE2 in
   the form of a forward defect notification.

   When NS OAM is not supported on PE1, and for PW over MPLS PSN or
   MPLS-IP PSN, forward defect notification is done via either PW Status
   message indicating a forward defect or via VCCV-BFD diagnostic code
   of forward defect if VCCV CV type of 0x08 or 0x20 (fault detection
   and status signaling modes) had been negotiated.

   When Native Service OAM mechanism is supported on PE1, it can also
   use the NS OAM notification.

   In addition to above actions, PE1 must perform the following:
        -i. If PE1 is configured with a MEP associated with the local AC
            and CCM transmission is configured to be turned ON, the MEP
            associated with AC must set the RDI bit in transmitted CCM
            frames.


12.1.2. Procedures for a FR/ATM PW in the out-of-band method

   On entry to the AC forward defect state, PE1 notifies PE2 of a
   forward defect:

   For PW over MPLS PSN or MPLS-IP PSN:
        -i. A PW Status message indicating forward defect, or
       -ii. A VCCV-BFD diagnostic code of forward defect if the optional
            use of VCCV-BFD notification has been negotiated.

   For PW over L2TP-IP PSN:
        -i. An L2TP Set-Link Info (SLI) message with a Circuit Status
            AVP indicating "inactive", along with a more specific
            extended status [L2TP-Status], or
       -ii. A VCCV-BFD diagnostic code of forward defect if the optional
            use of VCCV-BFD notification has been negotiated.










Nadeau, et al.              Standards Track                    [Page 30]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


12.1.3. Procedures for a ATM PW in the inband PW Method

   On entry to the AC forward defect state, PE1 MUST:
        -i. Commence insertion of ATM AIS cells into the corresponding
            PW.
       -ii. If PE1 is originating F4 or F5 I.610 CC cells, PE1 will
            suspend CC generation for the duration of the defect state.


12.1.4. Additional procedures for ATM ACs

   On entry to the AC forward defect state PE1 will commence RDI
   insertion into the AC as per I.610. This procedure is applicable to
   the out-of-band ATM OAM over PW method only.


12.2. AC Reverse defect entry

12.2.1. Ethernet AC Procedures

   When AC status transitions from working to AC Reverse defect, PE1's
   ability to transmit user traffic to CE1 is impacted. As a result, PE1
   needs to notify PE2 about this problem. If the AC Reverse defect is
   detected by PE1, it must notify PE2 in the form of a reverse defect
   notification.

   When NS OAM is not supported on PE, in PW over MPLS PSN or MPLS-IP
   PSN, reverse defect notification is either done via PW Status message
   indicating a reverse defect; or via VCCV-BFD diagnostic code of
   reverse defect if VCCV CV type of 0x08 or 0x20 (fault detection and
   status signaling modes) had been negotiated.

   When Native Service OAM mechanism is supported on PE, it can also use
   the NS OAM notification as specified in Section 3.1.


12.2.2. Procedures for a FR/ATM PW in the out-of-band method

   On entry to the AC reverse defect state, PE1 notifies PE2 of a
   reverse defect:

   For PW over MPLS PSN or MPLS-IP PSN:
        -i. A PW Status message indicating reverse defect,or
       -ii. A VCCV-BFD diagnostic code of reverse defect if the optional
            use of VCCV-BFD notification has been negotiated.

            For PW over L2TP-IP PSN:




Nadeau, et al.              Standards Track                    [Page 31]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


                 -i. An L2TP Set-Link Info (SLI) message with a Circuit
                     Status AVP indicating "inactive", along with a more
                     specific extended status [L2TP-Status], or
                -ii. A VCCV-BFD diagnostic code of reverse defect if the
                     optional use of VCCV-BFD notification has been
                     negotiated.


12.2.3. Procedures for a ATM PW in the inband PW Method

   There are no procedures in this case as the AC reverse defect state
   is not valid for PE1 operating in this method.


12.3. AC Forward Defect Exit

12.3.1. Ethernet AC Procedures

   When AC status transitions from AC Forward defect to working, PE1's
   ability to receive user traffic from CE1 is restored. As a result,
   PE1 needs to cease defect notifications to PE2 and CE1 and perform
   the following:
        -i. When NS OAM is not supported on PE1 and for PW over MPLS PSN
            or MPLS-IP PSN, forward defect notification is cleared via
            PW Status message indicating a working state; or via VCCV-
            BFD diagnostic code if VCCV CV type of 0x08 or 0x20 (fault
            detection and status signaling modes) had been negotiated.
       -ii. When Native Service OAM mechanism is supported on PE1, PE1
            clears the NS OAM notification as specified in Section 3.1.
      -iii. If PE1 is configured with a MEP associated with the local AC
            and CCM transmission is configured to be turned ON, the MEP
            associated with the AC must clear the RDI bit in transmitted
            CCM frames to the peer MEP in the client domain (e.g. on
            CE1).


12.3.2. Procedures for a FR/ATM PW in the out-of-band method

   On exit from the AC forward defect state PE1 notifies PE2 that the
   forward defect state has cleared (note that this may be a direct
   state transition to either the working state or the reverse defect
   state):

   For PW over MPLS PSN or MPLS-IP PSN:
        -i. A PW Status message with forward defect clear and the
            remaining indicators showing either working or reverse
            defect state, or




Nadeau, et al.              Standards Track                    [Page 32]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


       -ii. A VCCV-BFD diagnostic code with the same attributes as (i)
            if the optional use of VCCV-BFD notification has been
            negotiated.

   For PW over L2TP-IP PSN:
        -i. An L2TP Set-Link Info (SLI) message with a Circuit Status
                    AVP indicating "active", or
       -ii. A VCCV-BFD diagnostic code with the same attributes as (i)
            if the optional use of VCCV-BFD notification has been
            negotiated.


12.3.3. Procedures for a ATM PW in the inband PW Method

   On exit from the AC forward defect state, PE1 MUST:
        -i. Cease insertion of ATM AIS cells into the corresponding PW.
       -ii. If PE1 is originating F4 or F5 I.610 CC cells, PE1 will
            resume CC generation for the duration of the defect state.


12.3.4. Additional procedures for ATM ACs

   On exit from the AC forward defect state PE1 will cease RDI insertion
   into the AC as per I.610. This procedure is applicable to the out-
   of-band ATM OAM over PW method only.


12.4. AC Reverse Defect Exit

12.4.1. Ethernet AC Procedures

   When AC status transitions from AC Reverse defect to working, PE1's
   ability to transmit user traffic to CE1 is restored. As a result, PE1
   needs to clear notification to PE2.

   If the AC Reverse defect is cleared, PE1 must clear reverse defect
   notification to PE2.

   When NS OAM is not supported on PE1 and for PW over MPLS PSN or
   MPLS-IP PSN, reverse defect notification is cleared via either a PW
   Status message indicating a working state or via VCCV-BFD diagnostic
   code of if VCCV CV type of 0x08 or 0x20 (fault detection and status
   signaling modes) had been negotiated.

   When Native Service OAM mechanism is supported on PE1, PE1 can clear
   NS OAM notification.





Nadeau, et al.              Standards Track                    [Page 33]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


12.4.2. Procedures for a FR/ATM PW in the out-of-band method

   On exit from the AC reverse defect state, PE1 notifies PE2 that the
   reverse defect state has cleared (note that this may be a direct
   state transition to either the working state or the forward defect
   state):

   For PW over MPLS PSN or MPLS-IP PSN:
        -i. A PW Status message with the reverse defect indicator
            cleared and the remaining indicators showing either working
            or a transition to the forward defect state, or
       -ii. A VCCV-BFD diagnostic code with the same information as if
            the optional use of VCCV-BFD notification has been
            negotiated.

            For PW over L2TP-IP PSN:
                 -i. An L2TP Set-Link Info (SLI) message with a Circuit
                     Status AVP indicating "active", or
                -ii. A VCCV-BFD diagnostic code with the same
                     information as
               -iii. if the optional use of VCCV-BFD notification has
                     been negotiated.


12.4.3. Procedures for a ATM PW in the inband PW method

   There are no procedures in this case as the AC reverse defect state
   is not valid for PE1 operating in this method.


13. SONET Encapsulation (CEP)

   Loss of Connectivity and other SONET/SDH protocol failures on the PW
   are translated to alarms on the ACs and vice versa. In essence, all
   defect management procedures are handled entirely in the emulated
   protocol. There is no need for an interaction between PW defect
   management and SONET layer defect management.


14. TDM Encapsulation

   From an OAM perspective, the PSN carrying a TDM PW provides the same
   function as that of SONET/SDH or ATM network carrying the same low-
   rate TDM stream. Hence the interworking of defect OAM is similar.

   For structure-agnostic TDM PWs, the TDM stream is to be carried
   transparently across the PSN, and this requires TDM OAM indications
   to be transparently transferred along with the TDM data. For



Nadeau, et al.              Standards Track                    [Page 34]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   structure-aware TDM PWs the TDM structure alignment is terminated at
   ingress to the PSN and regenerated at egress, and hence OAM
   indications may need to be signaled by special means. In both cases
   generation of the appropriate emulated OAM indication may be required
   when the PSN is at fault.

   Since TDM is a real-time signal, defect indications and performance
   measurements may be classified into two classes, urgent and
   deferrable.  Urgent messages are those whose contents may not be
   significantly delayed with respect to the TDM data that they
   potentially impact, while deferrable messages may arrive at the far
   end delayed with respect to simultaneously generated TDM data. For
   example, a forward indication signifying that the TDM data is invalid
   (e.g. TDM loss of signal, or MPLS loss of packets) is only of use
   when received before the TDM data is to be played out towards the far
   end TDM system. It is hence classified as an urgent message, and we
   can not delegate its signaling to a separate maintenance or
   management flow.  On the other hand, the forward loss of multi-frame
   synchronization, and most reverse indications do not need to be acted
   upon before a particular TDM frame is played out.

   From the above discussion it is evident that the complete solution to
   OAM for TDM PWs needs to have at least two, and perhaps three
   components. The required functionality is transparent transfer of
   native TDM OAM and urgent transfer of indications (by flags) along
   with the impacted packets.  Optionally there may be mapping between
   TDM and PSN OAM flows.

   TDM AIS generated in the TDM network due to a fault in that network
   is generally carried unaltered, although the TDM encapsulations allow
   for its suppression for bandwidth conservation purposes. Similarly,
   when the TDM loss of signal is detected at the PE, it will generally
   emulate TDM AIS.

   SAToP and the two structure-aware TDM encapsulations have converged
   on a common set of defect indication flags in the PW control word.
   When the PE detects or is informed of lack of validity of the TDM
   signal, it raises the local ("L") defect flag, uniquely identifying
   the defect as originating in the TDM network. The remote PE must
   ensure that TDM AIS is delivered to the remote TDM network. When the
   defect lies in the MPLS network, the remote PE fails to receive
   packets. The remote PE generates TDM AIS towards its TDM network, and
   in addition raises the remote defect ("R") flag in its PSN-bound
   packets, uniquely identifying the defect as originating in the PSN.
   Finally, defects in the remote TDM network that cause RDI generation
   in that network, may optionally be indicated by proper setting of the
   field of valid packets in the opposite direction.




Nadeau, et al.              Standards Track                    [Page 35]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


Ap A Native Service Management

Ap A.1 Frame Relay Management

   The management of Frame Relay Bearer Service (FRBS) connections can
   be accomplished through two distinct methodologies:
        -i. Based on ITU-T Q.933 Annex A, Link Integrity Verification
            procedure, where STATUS and STATUS ENQUIRY signaling
            messages are sent using DLCI=0 over a given UNI and NNI
            physical link. [ITU-T Q.933]
       -ii. Based on FRBS LMI, and similar to ATM ILMI where LMI is
            common in private Frame Relay networks.

   In addition, ITU-T I.620 addresses Frame Relay loopback, but the
   deployment of this standard is relatively limited. [ITU-T I.620]

   It is possible to use either, or both, of the above options to manage
   Frame Relay interfaces. This document will refer exclusively to Q.933
   messages.

   The status of any provisioned Frame Relay PVC may be updated through:
     - STATUS messages in response to STATUS ENQUIRY messages, these are
       mandatory.
     - Optional unsolicited STATUS updates independent of STATUS ENQUIRY
       (typically under the control of management system, these updates
       can be sent periodically (continuous monitoring) or only upon
       detection of specific defects based on configuration.

       In Frame Relay, a DLC is either up or down. There is no
       distinction between different directions. TO achieve commonality
       with other technologies, down is represented as a forward defect.

       Frame relay connection management is not implemented over the PW
       using either of the techniques native to FR, therefore PW
       mechanisms are used to synchronize the view each PE has of the
       remote NS/AC. A PE will treat a remote NS/AC failure in the same
       way it would treat a PW or PSN failure, that is using AC facing
       FR connection management to notify the CE that FR is down.


Ap A.2 ATM Management

   ATM management and OAM mechanisms are much more evolved than those of
   Frame Relay.  There are five broad management-related categories,
   including fault management (FT), Performance management (PM),
   configuration management (CM), Accounting management (AC), and
   Security management (SM). ITU-T Recommendation I.610 describes the
   functions for the operation and maintenance of the physical layer and



Nadeau, et al.              Standards Track                    [Page 36]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   the ATM layer, that is, management at the bit and cell levels ([ITU-T
   I.610]). Because of its scope, this document will concentrate on ATM
   fault management functions. Fault management functions include the
   following:

   1) Alarm indication signal (AIS) 2) Remote Defect indication (RDI).
   3) Continuity Check (CC).  4) Loopback (LB)

   Some of the basic ATM fault management functions are described as
   follows:  Alarm indication signal (AIS) sends a message in the same
   direction as that of the signal, to the effect that an error has been
   detected.

   Remote defect indication (RDI) sends a message to the transmitting
   terminal that an error has been detected. RDI is also referred to as
   the far-end reporting failure. Alarms related to the physical layer
   are indicated using path AIS/RDI. Virtual path AIS/RDI and virtual
   channel AIS/RDI are also generated for the ATM layer.

   OAM cells (F4 and F5 cells) are used to instrument virtual paths and
   virtual channels respectively with regard to their performance and
   availability. OAM cells in the F4 and F5 flows are used for
   monitoring a segment of the network and end-to-end monitoring. OAM
   cells in F4 flows have the same VPI as that of the connection being
   monitored. OAM cells in F5 flows have the same VPI and VCI as that of
   the connection being monitored. The AIS and RDI messages of the F4
   and F5 flows are sent to the other network nodes via the VPC or the
   VCC to which the message refers. The type of error and its location
   can be indicated in the OAM cells. Continuity check is another fault
   management function. To check whether a VCC that has been idle for a
   period of time is still functioning, the network elements can send
   continuity-check cells along that VCC.


Ap A.3 Ethernet Management

   Ethernet OAM mechanisms are broadly classified into two categories:
   Fault Management (FM) and Performance Monitoring (PM). ITU-T Y.1731
   provides coverage for both FM and PM while IEEE 802.1ag provides
   coverage for a sub-set of FM functions.

   Ethernet OAM also introduces the concept of Maintenance Entity (ME)
   which is used to identify the entity that needs to be managed. A ME
   is inherently a point-to-point association. However, in case of a
   multipoint association, Maintenance Entity Group (MEG) consisting of
   different MEs is used. IEEE 802.1 uses the concept of Maintenance
   Association (MA) which is used to identify both point-to-point and
   multipoint associations. Each MA consists of Maintenance End Points



Nadeau, et al.              Standards Track                    [Page 37]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   (MEPs) which are responsible for originating OAM frames. In between
   the MEPs, there can also be Maintenance Intermediate Points (MIPs)
   which do not originate OAM frames however do respond to OAM frames
   from MEPs.

   Ethernet OAM allows for hierarchical maintenance entities to allow
   for simultaneous end-to-end and segment monitoring. This is achieved
   by having a provision of up to 8 Maintenance Domain Levels (MD

   It is important to note that the common set of FM mechanisms between
   IEEE 802.1ag and ITU-T Y.1731 are completely compatible.

   The common FM mechanisms include:

   1) Continuity Check Messages (CCM) 2) Loopback Message (LBM) and
   Loopback Reply (LBR) 3) Linktrace Message (LTM) and Linktrace Reply
   (LTR)

   CCM messages are used for fault detection including misconnections
   and mis-configurations. Typically CCM messages are sent as multicast
   frames or Unicast frames and also allow RDI notifications. LBM/LBR
   are used to perform fault verification, while also allow for MTU
   verification and CIR/EIR measurements. LTM/LTR can be used for
   discovering the path traversed between a MEP and another target
   MIP/MEP in the same MA. LTM/LTR also allow for fault localization.

   In addition, ITU-T Y.1731 also specifies the following FM functions:

   4) Alarm Indication Signal (AIS)

   AIS allows for fault notification to downstream and upstream nodes.

   Further, ITU-T Y.1731 also specifies the following PM functions:

   5) Loss Measurement Message (LMM) and Reply (LMR) 6) Delay
   Measurement Message (DMR) and Reply (DMR) 7) 1-way Delay Message
   (1DM)

   While LMM/LMR is used to measure Frame Loss Ratio (FLR), DMM/DMR is
   used to measure single-ended (aka two-way) Frame Delay (FD) and Frame
   Delay Variation (FDV, also known as Jitter). 1DM can be used for
   dual-ended (aka one-way) FD and FDV measurements.









Nadeau, et al.              Standards Track                    [Page 38]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


15. Security Considerations

   The mapping messages described in this document do not change the
   security functions inherent in the actual messages.


16. IANA Considerations

   None at this time.


17. References

17.1. Normative References

   [BFD] Katz, D., Ward, D., "Bidirectional Forwarding Detection",
        draft-ietf-bfd-base-08 (work in progress), March 2008

   [FRF.19] Frame Relay Forum, Frame Relay Operations,
        Administration, and Maintenance Implementation Agreement,
        March 2001.

   [RFC792] Postel, J. "Internet Control Message Protocol",
        RFC792

   [ITU-T I.610] Recommendation I.610 "B-ISDN operation and
        maintenance principles and functions", February 1999

   [ITU-T I.620] Recommendation I.620 "Frame relay operation and
        maintenance principles and functions", October 1996

   [ITU-T Q.933] Recommendation Q.933 " ISDN Digital Subscriber
        Signalling System No. 1 (DSS1) Signalling specifications
        for frame mode switched and permanent virtual connection
        control and status monitoring" February 2003

   [RFC3931] Lau, J., et.al. " Layer Two Tunneling Protocol (Version
        3", RFC 3931, March 2005

   [RFC4379] Kompella, K., Pan, P., Sheth, N., Cooper, D., Swallow,
        G., Wadhwa, S., Bonica, R., " Detecting MPLS Data Plane
        Failures", RFC4379, February 2006.

   [RFC4023] Worster. T., et al., Encapsulating MPLS in IP or
        Generic Routing Encapsulation (GRE), RFC 4023, March 2005.

   [RFC5085] Nadeau, T., et al."Pseudo Wire Virtual Circuit Connection
        Verification (VCCV)", RFC 5085  December 2007.



Nadeau, et al.              Standards Track                    [Page 39]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


   [Y.1731] "OAM Functions and mechanisms for Ethernet based networks",
        ITU-T Y.1731, May 2006

   [802.1ag] "Connectivity Fault Management", IEEE 802.1ag/D8.1, Jul
        2007

   [RFC4454]  Singh, S., Townsley, M., and C. Pignataro, "Asynchronous
        Transfer Mode (ATM) over Layer 2 Tunneling Protocol
        Version 3 (L2TPv3)", RFC 4454, May 2006.

   [VCCV-BFD] Nadeau, T. and C. Pignataro, "Bidirectional Forwarding
        Detection (BFD) for the Pseudowire Virtual Circuit
        Connectivity Verification (VCCV)",
        draft-ietf-pwe3-vccv-bfd-02 (work in progress), June 2008.

   [MEF.16] "Ethernet Local Management Interface", MEF.16, January 2006


17.2. Informative References

   [RFC3985] Bryant, S., "Pseudo Wire Emulation Edge-to-Edge (PWE3)
        Architecture", RFC 3985, March 2005.

   [RFC4377] Nadeau, T. et.al., "OAM Requirements for MPLS Networks",
        RFC4377, February 2006.

   [RFC4447] Martini, L., Rosen, E., Smith, T., "Pseudowire
        Setup and Maintenance using LDP", RFC4447, April 2006.

   [RFC4446] Martini, L., et al., "IANA Allocations for pseudo
        Wire Edge to Edge Emulation (PWE3)", RFC4446,
        April 2006.

   [RFC4717] Martini, L., et al., "Encapsulation Methods for Transport
        of ATM Cells/Frame Over IP and MPLS Networks", RFC4717,
        December 2006

   [RFC3916] Xiao, X., McPherson, D., Pate, P., "Requirements for
        Pseudo Wire Emulation Edge to-Edge (PWE3)", RFC 3916,
        September 2004

   [RFC3209] Awduche, D., et.al. "RSVP-TE: Extensions to RSVP for
        LSP Tunnels", RFC 3209, December 2001

   [L2TP-Status] McGill, N. and C. Pignataro, "L2TPv3 Extended Circuit
        Status Values",
        draft-nmcgill-l2tpext-circuit-status-extensions-01 (work
        in progress), June 2008.



Nadeau, et al.              Standards Track                    [Page 40]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


18. Editors' Addresses


   Thomas D. Nadeau
   BT
   BT Centre
   81 Newgate Street
   London  EC1A 7AJ
   United Kingdom
   EMail: tom.nadeau@bt.com


   Monique Morrow
   Cisco Systems, Inc.
   Glatt-com
   CH-8301 Glattzentrum
   Switzerland
   EMail: mmorrow@cisco.com


   Luca Martini
   Cisco Systems, Inc.
   9155 East Nichols Avenue, Suite 400
   Englewood, CO, 80112
   USA
   EMail: lmartini@cisco.com


   Carlos Pignataro
   Cisco Systems, Inc.
   7200-12 Kit Creek Road
   PO Box 14987
   Research Triangle Park, NC  27709
   USA
   Email: cpignata@cisco.com


   Dinesh Mohan
   Nortel
   3500 Carling Ave
   Ottawa, ON K2H8E9
   Canada
   EMail: mohand@nortel.com








Nadeau, et al.              Standards Track                    [Page 41]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


19. Intellectual Property Statement

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at ietf-
   ipr@ietf.org.


20. Full Copyright Statement

   Copyright (C) The IETF Trust (2008).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.











Nadeau, et al.              Standards Track                    [Page 42]

Internet Draft     draft-ietf-pwe3-oam-msg-map-07.txt          July 2008


21. Acknowledgment

   Funding for the RFC Editor function is currently provided by the
   Internet Society.















































Nadeau, et al.              Standards Track                    [Page 43]

